# Inferential Statistics Test

In [2]:
import pandas as pd 
import numpy as np 
import scipy.stats as stats
from scipy.stats import chi2_contingency # Does chi-test
from scipy.stats import chisquare
from scipy.stats import ttest_1samp
from scipy.stats import f_oneway
import statsmodels.api as sm
from statsmodels.formula.api import ols
from scipy.stats import norm
from scipy.stats import ttest_rel

> - Perform one-sample t-test

Q1: Is the mean sepal length significantly different from 5.0? (Answer: p < 0.05, so yes/no)

In [3]:
iris = pd.read_csv(r'C:\Users\user\Downloads\Iris.csv') 

setosa_sepal_length = iris[iris['Species'] == 'Iris-setosa']['SepalLengthCm']

In [22]:
iris.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [15]:
alternative_hypothesis = "The mean length is significantly different from 5.0"
null_hypothesis = "The mean length is not significantly different from 5.0"

In [80]:
sample_data = setosa_sepal_length
population_mean = 5.0
alpha = 0.05
t_stat, p_value = ttest_1samp(sample_data, population_mean)
print(f"T-statistic: {t_stat}")
print(f"P-value: {p_value}")


if p_value < alpha:
    print(f'Reject the null hypothesis which is {null_hypothesis}')
else:
    print(f'Fail to reject the null hypothesis which is {null_hypothesis}')

T-statistic: 0.12036212238318053
P-value: 0.9046884777690936
Fail to reject the null hypothesis which is There is no significant difference in math scores across ethnic groups

Question 2: Two-sample t-test on Iris dataset Task: Compare sepal width of Iris-setosa and Iris-versicolor. setosa_sepal_width = iris[iris['Species'] == 'Iris-setosa']['SepalWidthCm'] versicolor_sepal_width = iris[iris['Species'] == 'Iris-versicolor']['SepalWidthCm']

In [18]:
setosa_sepal_width = iris[iris['Species'] == 'Iris-setosa']['SepalWidthCm'] 
versicolor_sepal_width = iris[iris['Species'] == 'Iris-versicolor']['SepalWidthCm']

In [20]:
t_stat, p_value = stats.ttest_ind(setosa_sepal_width, versicolor_sepal_width, equal_var = True)

print(t_stat)
print(p_value)

if p_value < 0.05:
    print('The mean of setosa_sepal_width is significantly different from the mean of versicolor_sepal_width') # Alternative hypothesis
else:
    print('The mean of setosa_sepal_width is not significantly different from the mean of versicolor_sepal_width') # Null hypothesis

9.282772555558111
4.362239016010214e-15
The mean of setosa_sepal_width is significantly different from the mean of versicolor_sepal_width

# Perform two-sample t-test (assume equal variances)

Q2: Are the means significantly different? (Answer: p < 0.05, so yes/no)

In [24]:
samplep_length = iris['PetalLengthCm']
samplep_width = iris['PetalWidthCm']

In [25]:
t_stat, p_value = stats.ttest_ind(samplep_length, samplep_width, equal_var = True)

print(t_stat)
print(p_value)

if p_value < 0.05:
    print('The mean of samplep_length is significantly different from the mean of samplep_width') # Alternative hypothesis
else:
    print('The mean of samplep_length is not significantly different from the mean of samplep_width') # Null hypothesis

16.30960652586687
3.4939777342299616e-43
The mean of samplep_length is significantly different from the mean of samplep_width

# One-way ANOVA

Question 3: One-way ANOVA on Iris dataset Task: Test if petal length differs across all three Iris species.

In [27]:
# Identify if there is any significance difference between the petal length

alternative_hypothesis = 'There is a significant difference between the petal length across all three isis species'
null_hypothesis = 'There is no significant difference between the petal length across all three isis species'

# Then we get the petal length of all the three species

setosa_petal = iris[iris['Species'] == 'Iris-setosa']['PetalLengthCm']
versicolor_petal = iris[iris['Species'] == 'Iris-versicolor']['PetalLengthCm']
virginica_petal = iris[iris['Species'] == 'Iris-virginica']['PetalLengthCm']

f_stat, p_value = f_oneway(setosa_petal, versicolor_petal, virginica_petal)

print(f_stat)
print(p_value)

if p_value < 0.05:
    print(f'Reject the null hypothesis which is {null_hypothesis}')
else:
    print(f'We fail to reject the null hypothesis which is {null_hypothesis}')

1179.0343277002194
3.0519758018278374e-91
Reject the null hypothesis which is There is no significant difference between the petal length across all three isis species

# Perform chi-square test

Question 4: Chi-square test on Titanic dataset 

Task: Load the Titanic dataset and test if survival is independent of passenger class (Pclass).

titanic = pd.read_csv('titanic.csv') 

contingency_table = pd.crosstab(titanic['Survived'], titanic['Pclass'])

In [4]:
# Task: Load the Titanic dataset and test if survival is independent of passenger class (Pclass).

titanic = pd.read_csv(r'C:\Users\user\Downloads\tested.csv') 

# contingency_table = pd.crosstab(titanic['Survived'], titanic['Pclass'])

titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [ ]:
contingency_table = pd.crosstab(titanic['Survived'], titanic['Pclass']) # Create the table
print(contingency_table)

Pclass     1   2    3
Survived
0         57  63  146
1         50  30   72

In [ ]:
chi2, p, dof, expected = chi2_contingency(contingency_table)
print(f'chi2: {chi2}')
print(f'p: {p}')
print(f'degrees of freedom: {dof}')
print(f'expected: {expected}')


alternative_hypothesis = 'There is a direct relationship between survival and passenger class'
null_hypothesis = 'There is no direct relationship between survival and passenger class'

if p < 0.05:
    print(f'Reject the null hypothesis which is {null_hypothesis}')
else:
    print(f'We fail to reject the null hypothesis which is {null_hypothesis}')

chi2: 6.693869422819262
p: 0.03519206276590605
degrees of freedom: 2
expected: [[ 68.09090909  59.18181818 138.72727273]
 [ 38.90909091  33.81818182  79.27272727]]

# Perform one-sample z-test

One-sample z-test on Titanic dataset Task: Test if the mean age of passengers is equal to 30 (assume population std = 14.5).

Is the mean age significantly different from 30? (Answer: p < 0.05, so yes/no)

In [46]:
# sd is the sigma

alternative_hypothesis_6 = 'The mean age of passengers is 30'
null_hypothesis_6 = 'The mean age of passengers is significantly different from 30'

In [48]:
titanic = pd.read_csv(r'C:\Users\user\Downloads\tested.csv') 
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [51]:
# Get the age column

ages = titanic['Age'].dropna()

mu = 30 # population mean
sigma = 14.5
x_bar = ages.mean() # sample mean
n = len(ages)
alpha = 0.05


z = (x_bar - mu)/(sigma/np.sqrt(n))
p_value = norm.cdf(z) 
print(z)
print(p_value)

if p_value < alpha:
    print(f'Reject The Null Hypothesis Which is: {null_hypothesis_6}!')
else:
    print(f'We Fail To Reject The Null Hypothesis!')

0.3425401906574815
0.6340277982702243
We Fail To Reject The Null Hypothesis!

# Perform independent t-test

Question 6: Independent t-test on Titanic dataset Task:

Compare mean age of male vs. female passengers. 

male_age = titanic[titanic['Sex'] == 'male']['Age'].dropna() 

female_age = titanic[titanic['Sex'] == 'female']['Age'].dropna()

Are the mean ages significantly different? (Answer: p < 0.05, so yes/no)

In [33]:
male_age = titanic[titanic['Sex'] == 'male']['Age'].dropna() 

female_age = titanic[titanic['Sex'] == 'female']['Age'].dropna()

In [34]:
t_stat, p_value = stats.ttest_ind(male_age, female_age, equal_var = True)

print(t_stat)
print(p_value)

if p_value < 0.05:
    print('The mean ages are significantly different across the two genders') # Alternative hypothesis
else:
    print('The mean ages are not significantly different across the two genders ') # Null hypothesis

0.000230386457754343
0.9998163174099579
The mean ages are not significantly different across the two genders

# Perform one-way ANOVA

Question 7: One-way ANOVA on Titanic dataset Task: 
 
Test if fare differs across passenger classes (Pclass).

Is there a significant difference in fare across classes? (Answer: p < 0.05, so yes/no)

In [38]:
alternative_hypothesis = 'There is a significant difference in fare across classes'
null_hypothesis = 'There is no significant difference in fare across classes'

In [39]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [40]:
class_one = titanic[(titanic['Pclass'] == 1) & (titanic['Fare'].notna())]['Fare']
class_two = titanic[(titanic['Pclass'] == 2) & (titanic['Fare'].notna())]['Fare']
class_three = titanic[(titanic['Pclass'] == 3) & (titanic['Fare'].notna())]['Fare']


f_stat, p_value = f_oneway(class_one, class_two, class_three)

print(f_stat)
print(p_value)

if p_value < 0.05:
    print(f'Reject the null hypothesis which is {null_hypothesis}')
else:
    print(f'We fail to reject the null hypothesis which is {null_hypothesis}')

129.89190776865905
1.641767321164957e-44
Reject the null hypothesis which is There is no significant difference in fare across classes

# Fill in: Perform chi-square test

Question 8: Chi-square test on Titanic dataset Task: 

Test if survival is independent of sex. contingency_table = pd.crosstab(titanic['Survived'], titanic['Sex'])

Is survival independent of sex? (Answer: p < 0.05, so yes/no)

In [36]:
contingency_table = pd.crosstab(titanic['Survived'], titanic['Sex']) # Create the table

print(contingency_table)

Sex       female  male
Survived
0              0   266
1            152     0

In [37]:
chi2, p, dof, expected = chi2_contingency(contingency_table)
print(f'chi2: {chi2}')
print(f'p: {p}')
print(f'degrees of freedom: {dof}')
print(f'expected: {expected}')


alternative_hypothesis = 'There is a significant difference in fare across classes'
null_hypothesis = 'There is no significant difference in fare across classes'

if p < 0.05:
    print(f'Reject the null hypothesis which is {null_hypothesis}')
else:
    print(f'We fail to reject the null hypothesis which is {null_hypothesis}')

chi2: 413.6897405343716
p: 5.767311139789629e-92
degrees of freedom: 1
expected: [[ 96.72727273 169.27272727]
 [ 55.27272727  96.72727273]]
Reject the null hypothesis which is There is no significant difference in fare across classes

# Perform paired t-test

Question 9: Paired t-test on Student Performance dataset Task: 

Load the Student Performance dataset and test if math score and reading score differ for the same students. 

students = pd.read_csv('StudentsPerformance.csv')

Are math and reading scores significantly different? (Answer: p < 0.05, so yes/no)

In [102]:
Alternative_hypothesis = 'The mean scores are significantly different'

Null_hypothesis = 'The mean scores are not significantly different'

In [103]:
# Extract the two score columns
reading = students['reading score']
maths = students['math score']

t_stat, p_value = ttest_rel(reading, maths)

print(t_stat)
print(p_value)

alpha = 0.05
if p_value < alpha:
    print(f'Reject The Null Hypothesis Which is: {Null_hypothesis}!')
else:
    print(f'We Fail To Reject The Null Hypothesis!')

10.816230631665421
7.322335900414138e-26
Reject The Null Hypothesis Which is: The mean scores are not significantly different!

# Perform one-sample z-test

Question 10: One-sample z-test on Student Performance dataset Task: 

Test if the mean writing score is equal to 70 (assume population std = 15).

Is the mean writing score significantly different from 70? (Answer: p < 0.05, so yes/no)

In [5]:
students = pd.read_csv(r'C:\Users\user\Downloads\StudentsPerformance (1).csv')
students.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [58]:
alternative_hypothesis = "The mean writing score is equal to 70"
null_hypothesis = 'The mean writing score is different from 70'

In [59]:
writing_scores = students['writing score'].dropna()

mu = 70 # population mean
sigma = 15
x_bar = writing_scores.mean() # sample mean
n = len(writing_scores)
alpha = 0.05


z = (x_bar - mu)/(sigma/np.sqrt(n))
p_value = norm.cdf(z) 
print(z)
print(p_value)

if p_value < alpha:
    print(f'Reject The Null Hypothesis Which is: {null_hypothesis}!')
else:
    print(f'We Fail To Reject The Null Hypothesis!')

-4.1025282177917735
2.0432999838460062e-05
Reject The Null Hypothesis Which is: The mean writing score is different from 70!

# Perform two-sample t-test

Question 11: Two-sample t-test on Student Performance dataset

Task: Compare math scores of male vs. female students. 

male_math = students[students['gender'] == 'male']['math score'] 

female_math = students[students['gender'] == 'female']['math score']

Are math scores significantly different between genders? (Answer: p < 0.05, so yes/no)

In [61]:
male_math = students[students['gender'] == 'male']['math score'] 

female_math = students[students['gender'] == 'female']['math score']

t_stat, p_value = stats.ttest_ind(male_math, female_math, equal_var = True)

print(t_stat)
print(p_value)

if p_value < 0.05:
    print('The math scores are significantly different between genders') # Alternative hypothesis
else:
    print('The math scores are not significantly different between genders') # Null hypothesis

5.383245869828983
9.120185549328822e-08
The math scores are significantly different between genders

# Perform one-way ANOVA

Question 12: One-way ANOVA on Student Performance dataset 

Task: Test if math scores differ across ethnic groups (race/ethnicity).

Is there a significant difference in math scores across ethnic groups? (Answer: p < 0.05, so yes/no)

In [62]:
students.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [41]:
students['race/ethnicity'].unique()

array(['group B', 'group C', 'group A', 'group D', 'group E'],
      dtype=object)

In [42]:
alternative_hypothesis = 'There a significant difference in math scores across ethnic groups '
null_hypothesis = 'There is no significant difference in math scores across ethnic groups'

In [43]:
groupA_math= students[(students['race/ethnicity'] == 'group A') & (students['math score'].notna())]['math score']
groupB_math = students[(students['race/ethnicity'] == 'group B') & (students['math score'].notna())]['math score']
groupC_math = students[(students['race/ethnicity'] == 'group C') & (students['math score'].notna())]['math score']
groupD_math = students[(students['race/ethnicity'] == 'group D') & (students['math score'].notna())]['math score']
groupE_math = students[(students['race/ethnicity'] == 'group E') & (students['math score'].notna())]['math score']


f_stat, p_value = f_oneway(groupA_math, groupB_math, groupC_math, groupD_math,groupE_math )

print(f_stat)
print(p_value)

if p_value < 0.05:
    print(f'Reject the null hypothesis which is {null_hypothesis}')
else:
    print(f'We fail to reject the null hypothesis which is {null_hypothesis}')

14.593885166332635
1.3732194030370688e-11
Reject the null hypothesis which is There is no significant difference in math scores across ethnic groups

# Perform chi-square test

Chi-square test on Student Performance dataset Task:

Test if gender is independent of test preparation course completion. 

contingency_table = pd.crosstab(students['gender'], students['test preparation course'])

In [76]:
contingency_table = pd.crosstab(students['gender'], students['test preparation course']) # Create the table
print(contingency_table)

test preparation course  completed  none
gender
female                         184   334
male                           174   308

In [77]:
chi2, p, dof, expected = chi2_contingency(contingency_table)
print(f'chi2: {chi2}')
print(f'p: {p}')
print(f'degrees of freedom: {dof}')
print(f'expected: {expected}')


alternative_hypothesis = 'There is a significant difference in math scores across ethnic groups'
null_hypothesis = 'There is no significant difference in math scores across ethnic groups'

if p < 0.05:
    print(f'Reject the null hypothesis which is {null_hypothesis}')
else:
    print(f'We fail to reject the null hypothesis which is {null_hypothesis}')

chi2: 0.015529201882465888
p: 0.9008273880804724
degrees of freedom: 1
expected: [[185.444 332.556]
 [172.556 309.444]]
We fail to reject the null hypothesis which is There is no significant difference in math scores across ethnic groups

# Perform one-sample t-test

One-sample t-test on Iris dataset Task: 

Test if the mean petal width of Iris-virginica is equal to 2.0. virginica_petal_width = iris[iris['Species'] == 'Iris-virginica']['PetalWidthCm']

Is the mean petal width significantly different from 2.0? (Answer: p < 0.05, so yes/no)

In [ ]:
alternative_hypothesis = 'The mean petal width is equal to 2.0'
null_hypothesis = 'The mean petal width is different from 2.0'

virginica_petal_width = iris[iris['Species'] == 'Iris-virginica']['PetalWidthCm']

In [81]:
sample_data = virginica_petal_width
population_mean = 2.0
alpha = 0.05
t_stat, p_value = ttest_1samp(sample_data, population_mean)
print(f"T-statistic: {t_stat}")
print(f"P-value: {p_value}")


if p_value < alpha:
    print(f'Reject the null hypothesis which is {null_hypothesis}')
else:
    print(f'Fail to reject the null hypothesis which is {null_hypothesis}')

T-statistic: 0.6693891347748897
P-value: 0.5063892967407193
Fail to reject the null hypothesis which is There is no significant difference in math scores across ethnic groups

# Perform two-sample t-test (assume unequal variances)

Question 15: Two-sample t-test on Titanic dataset Task: 

Compare fare paid by survivors vs. non-survivors. 

survivor_fare = titanic[titanic['Survived'] == 1]['Fare'].dropna() 

nonsurvivor_fare = titanic[titanic['Survived'] == 0]['Fare'].dropna()

Are fares significantly different between survivors and non-survivors? (Answer: p < 0.05, so yes/no)

In [82]:
survivor_fare = titanic[titanic['Survived'] == 1]['Fare'].dropna() 

nonsurvivor_fare = titanic[titanic['Survived'] == 0]['Fare'].dropna()

In [83]:
t_stat, p_value = stats.ttest_ind(survivor_fare, nonsurvivor_fare, equal_var = False)

print(t_stat)
print(p_value)

if p_value < 0.05:
    print('The fares significantly different between survivors and non-survivors') # Alternative hypothesis
else:
    print('The fares are not significantly different between survivors and non-survivors') # Null hypothesis

3.4478682983060884
0.0006845156351814127
The fares significantly different between survivors and non-survivors

# Perform one-way ANOVA

Question 16: One-way ANOVA on Iris dataset Task: Test if sepal length differs across Iris species.

Is there a significant difference in sepal length across species? (Answer: p < 0.05, so yes/no)

In [84]:
iris.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [85]:
# Identify if there is any significance difference between the sepal length

alternative_hypothesis = 'There is a significant difference in sepal length across species'
null_hypothesis = 'There is no significant difference in sepal length across species'

# Then we get the sepal  length of all the three species

setosa_length = iris[iris['Species'] == 'Iris-setosa']['SepalLengthCm']
versicolor_length = iris[iris['Species'] == 'Iris-versicolor']['SepalLengthCm']
virginica_length = iris[iris['Species'] == 'Iris-virginica']['SepalLengthCm']

f_stat, p_value = f_oneway(setosa_length, versicolor_length, virginica_length)

print(f_stat)
print(p_value)

if p_value < 0.05:
    print(f'Reject the null hypothesis which is {null_hypothesis}')
else:
    print(f'We fail to reject the null hypothesis which is {null_hypothesis}')

119.26450218450468
1.6696691907693826e-31
Reject the null hypothesis which is There is no significant difference in sepal length across species

# Perform chi-square test

Question 17: Chi-square test on Titanic dataset Task: 

Test if embarkation port (Embarked) is independent of passenger class. 

contingency_table = pd.crosstab(titanic['Embarked'], titanic['Pclass'])

Is embarkation port independent of passenger class? (Answer: p < 0.05, so yes/no)

In [87]:
contingency_table = pd.crosstab(titanic['Embarked'], titanic['Pclass'])
print(contingency_table)

Pclass     1   2    3
Embarked
C         56  11   35
Q          1   4   41
S         50  78  142

In [88]:
chi2, p, dof, expected = chi2_contingency(contingency_table)
print(f'chi2: {chi2}')
print(f'p: {p}')
print(f'degrees of freedom: {dof}')
print(f'expected: {expected}')


alternative_hypothesis = 'The embarkation port is dependent of passenger class'
null_hypothesis = 'The embarkation port is not dependent of passenger class'

if p < 0.05:
    print(f'Reject the null hypothesis which is {null_hypothesis}')
else:
    print(f'We fail to reject the null hypothesis which is {null_hypothesis}')

chi2: 82.83186678873668
p: 4.373384811850251e-17
degrees of freedom: 4
expected: [[ 26.11004785  22.6937799   53.19617225]
 [ 11.77511962  10.23444976  23.99043062]
 [ 69.11483254  60.07177033 140.81339713]]
Reject the null hypothesis which is The embarkation port is not dependent of passenger class

# Perform one-sample z-test

Question 18: One-sample z-test on Student Performance dataset Task: 

Test if the mean math score is equal to 65 (assume population std = 15).

Is the mean math score significantly different from 65? (Answer: p < 0.05, so yes/no)

In [95]:
Alternative_hypothesis = 'The mean math score is equal to 65'

Null_hypothesis = 'The mean math score is different from 65'

In [90]:
students.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [96]:
math_scores = students['math score'].dropna()

sigma = 15

alpha = 0.05

mu = 65

n = len(math_scores)

x_bar = math_scores.mean()

z = (x_bar - mu)/(sigma/np.sqrt(n))
p_value = norm.cdf(z) 
print(z)
print(p_value)

if p_value < alpha:
    print(f'Reject The Null Hypothesis Which is: {Null_hypothesis}!')
else:
    print(f'We Fail To Reject The Null Hypothesis!')

2.2958135812822404
0.9891567287174134
We Fail To Reject The Null Hypothesis!

# Perform paired t-test

Question 19: Paired t-test on Student Performance dataset Task: 

Test if reading score and writing score differ for the same students.

Are reading and writing scores significantly different? (Answer: p < 0.05, so yes/no)

In [93]:
students.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [97]:
Alternative_hypothesis = 'The mean scores are significantly different'

Null_hypothesis = 'The mean scores are not significantly different'

In [101]:
# Extract the two score columns
reading = students['reading score']
writing = students['writing score']

t_stat, p_value = ttest_rel(reading, writing)

print(t_stat)
print(p_value)

alpha = 0.05
if p_value < alpha:
    print(f'Reject The Null Hypothesis Which is: {Null_hypothesis}!')
else:
    print(f'We Fail To Reject The Null Hypothesis!')

7.787445512854921
1.7054750946105386e-14
Reject The Null Hypothesis Which is: The mean scores are not significantly different!

# Perform two-sample t-test

Two-sample t-test on Iris dataset Task: Compare petal length of Iris-versicolor and Iris-virginica. 

versicolor_petal_length = iris[iris['Species'] == 'Iris-versicolor']['PetalLengthCm'] 

virginica_petal_length = iris[iris['Species'] == 'Iris-virginica']['PetalLengthCm']

Are petal lengths significantly different? (Answer: p < 0.05, so yes/no)

In [104]:
versicolor_petal_length = iris[iris['Species'] == 'Iris-versicolor']['PetalLengthCm'] 

virginica_petal_length = iris[iris['Species'] == 'Iris-virginica']['PetalLengthCm']

In [105]:
t_stat, p_value = stats.ttest_ind(versicolor_petal_length, virginica_petal_length, equal_var = True)

print(t_stat)
print(p_value)

if p_value < 0.05:
    print('The petal lengths significantly different') # Alternative hypothesis
else:
    print('The petal lengths are not significantly different') # Null hypothesis

-12.603779441384985
3.1788195478061495e-22
The petal lengths significantly different

# Perform one-way ANOVA

Question 21: One-way ANOVA on Student Performance dataset Task: 

Test if reading scores differ across test preparation course status.

Is there a significant difference in reading scores by test preparation?

In [106]:
students.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [107]:
students['test preparation course'].unique()

array(['none', 'completed'], dtype=object)

In [109]:
# Identify if there is any significance difference in reading scores

alternative_hypothesis = 'There is a significant difference in the reading scores by test preparation'
null_hypothesis = 'There is no significant difference in the reading scores by test preparation'


none_course = students[students['test preparation course'] == 'none']['reading score']
completed_course = students[students['test preparation course'] == 'completed']['reading score']


f_stat, p_value = f_oneway(none_course, completed_course)

print(f_stat)
print(p_value)

if p_value < 0.05:
    print(f'Reject the null hypothesis which is {null_hypothesis}')
else:
    print(f'We fail to reject the null hypothesis which is {null_hypothesis}')

61.96308687030073
9.081783336895556e-15
Reject the null hypothesis which is There is no significant difference in the reading scores by test preparation

# Perform chi-square test

Question 22: Chi-square test on Student Performance dataset Task: 

Test if parental level of education is independent of test preparation course. 

contingency_table = pd.crosstab(students['parental level of education'], students['test preparation course'])

Is parental education independent of test preparation? (Answer: p < 0.05, so yes/no)

In [7]:
contingency_table = pd.crosstab(students['parental level of education'], students['test preparation course'])
print(contingency_table)

test preparation course      completed  none
parental level of education
associate's degree                  82   140
bachelor's degree                   46    72
high school                         56   140
master's degree                     20    39
some college                        77   149
some high school                    77   102

In [8]:
chi2, p, dof, expected = chi2_contingency(contingency_table)
print(f'chi2: {chi2}')
print(f'p: {p}')
print(f'degrees of freedom: {dof}')
print(f'expected: {expected}')


alternative_hypothesis = 'The parental education is independent of test preparation'
null_hypothesis = 'The embarkation port is not independent of passenger class'

if p < 0.05:
    print(f'Reject the null hypothesis which is {null_hypothesis}')
else:
    print(f'We fail to reject the null hypothesis which is {null_hypothesis}')

chi2: 9.54407054307069
p: 0.08923388625809343
degrees of freedom: 5
expected: [[ 79.476 142.524]
 [ 42.244  75.756]
 [ 70.168 125.832]
 [ 21.122  37.878]
 [ 80.908 145.092]
 [ 64.082 114.918]]
We fail to reject the null hypothesis which is The embarkation port is not independent of passenger class

# Perform one-sample t-test

Question 23: One-sample t-test on Titanic dataset Task: Test if the mean fare is equal to 30.

Is the mean fare significantly different from 30? (Answer: p < 0.05, so yes/no)

In [9]:
alternative_hypothesis = 'The mean fare is 30'
null_hypothesis = 'The mean fare is significantly different from 30'

In [10]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [17]:
fares = titanic['Fare'].dropna()

In [19]:
sample_data = fares
population_mean = 30
alpha = 0.05
t_stat, p_value = ttest_1samp(sample_data, population_mean)
print(f"T-statistic: {t_stat}")
print(f"P-value: {p_value}")


if p_value < alpha:
    print(f'Reject the null hypothesis which is {null_hypothesis}')
else:
    print(f'Fail to reject the null hypothesis which is {null_hypothesis}')

T-statistic: 2.0553643800991495
P-value: 0.04046758014596787
Reject the null hypothesis which is The mean fare is significantly different from 30

# Perform two-sample t-test

Question 24: Two-sample t-test on Student Performance dataset Task: 

Compare writing scores of students with vs. without test preparation. 

prep_writing = students[students['test preparation course'] == 'completed']['writing score'] 

noprep_writing = students[students['test preparation course'] == 'none']['writing score']

Are writing scores significantly different by test preparation? (Answer: p < 0.05, so yes/no)

In [21]:
prep_writing = students[students['test preparation course'] == 'completed']['writing score'] 

noprep_writing = students[students['test preparation course'] == 'none']['writing score']

In [22]:
t_stat, p_value = stats.ttest_ind(prep_writing, noprep_writing, equal_var = True)

print(t_stat)
print(p_value)

if p_value < 0.05:
    print('The writing scores are significantly different by test preparation') # Alternative hypothesis
else:
    print('The writing scores are not significantly different by test preparation') # Null hypothesis

10.409173436808748
3.68529173524572e-24
The writing scores are significantly different by test preparation

# Perform one-way ANOVA

Question 25: One-way ANOVA on Titanic dataset Task: 

Test if age differs across embarkation ports (Embarked).

Is there a significant difference in age across embarkation ports? (Answer: p < 0.05, so yes/no)

In [23]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [24]:
titanic['Embarked'].unique()

array(['Q', 'S', 'C'], dtype=object)

In [26]:
Embarked_age = titanic['Embarked'].dropna()

In [ ]:
# Identify if there is any significance difference 

alternative_hypothesis = 'There is a significant difference in age across embarkation ports'
null_hypothesis = 'There is no significant difference in age across embarkation ports'

# Utilization of .notna

# notna() is a method used to check for non-missing (non-NaN) values in a pandas Series or DataFrame

# It returns:
# True for values that are not null / not NaN

# False for values that are NaN

q_age = titanic[(titanic['Embarked'] == 'Q') & (titanic['Age'].notna())]['Age']
s_age = titanic[(titanic['Embarked'] == 'S') & (titanic['Age'].notna())]['Age']
c_age = titanic[(titanic['Embarked'] == 'C') & (titanic['Age'].notna())]['Age']



f_stat, p_value = f_oneway(q_age, s_age, c_age )

print(f_stat)
print(p_value)

if p_value < 0.05:
    print(f'Reject the null hypothesis which is {null_hypothesis}')
else:
    print(f'We fail to reject the null hypothesis which is {null_hypothesis}')

5.562959660036746
0.004207167976872834
Reject the null hypothesis which is There is no significant difference in age across embarkation ports